package cn.lmf.entity;

import java.util.HashMap;

/**
 * V5版本错误码
 * @author 王俊华
 * @date 20180710 10:51:29
 * @modify 20180710 王俊华 创建
 */
public enum CCErrorCode{

    /**
     * OneLink返回给客户错误码
     */
    //综合类
    SUCCESS("0", "正确", "正确"),
    ERR10001("10001", "批量操作失败", "批量操作失败"),
    ERR10002("10002", "批量信息同步失败", "批量信息同步失败"),
    ERR10003("10003", "卡号信息已存在，不需同步", "卡号信息已存在，不需同步"),
    ERR10004("10004", "抱歉，该接口暂时不可用", "抱歉，该接口暂时不可用"),
    ERR10005("10005", "AI处理失败", "OneNET-AI平台处理结果错误"),
    ERR10006("10006", "请求的地址不存在", "请求URL错误"),
    ERR10007("10007", "卡号未开通当前查询业务，请开通后再进行查询", "卡号未开通当前查询业务，请开通后再进行查询"),
    ERR10008("10008", "实名认证用户信息变更失败", "实名认证用户信息变更失败"),
    ERR10009("10009", "商品中存在已申请或已订购API，不能立即订购，请您联系管理员", "商品中存在已申请或已订购API，不能立即订购，请您联系管理员"),
    ERR10010("10010","该接口仅支持POST请求","该接口仅支持POST请求"),
    ERR10011("10011","该接口仅支持GET请求","该接口仅支持GET请求"),
    ERR10012("10012","OneLink-CT平台账号密码认证失败","OneLink-CT平台账号密码认证失败"),
    //参数类
    ERR11000("11000", "请求参数不正确，请参考能力调用文档", "请求参数不正确，请参考能力调用文档"),
    ERR11001("11001", "请求参数命名不规范，请参考能力调用文档", "请求参数命名不规范，请参考能力调用文档"),
    ERR11002("11002", "日期参数格式不正确，请参考能力调用文档", "日期参数格式不正确，请参考能力调用文档"),
    ERR11003("11003", "请求参数的内容非法，请参考能力调用文档", "请求参数的内容非法，请参考能力调用文档"),
    ERR11004("11004", "ECID数量超出限制范围，请核查", "ECID数量超出限制范围，请核查"),
    ERR11005("11005", "卡号数量超出限制范围，请核查", "卡号数量超出限制范围，请核查"),
    ERR11006("11006", "查询时间超出限制范围，请参考能力调用文档", "查询时间超出限制范围，请参考能力调用文档"),
    ERR11007("11007", "查询号码全部非法，请确认号码正确性", "查询号码全部非法，请确认号码正确性"),
    ERR11008("11008", "type参数值错误，请参考能力调用文档", "type参数值错误，请参考能力调用文档"),
    ERR11009("11009", "短信长度超过140字节，请检查短信长度", "短信长度超过140字节，请检查短信长度"),
    ERR11010("11010", "动作码错误，请核查", "动作码错误，请核查"),
    ERR11011("11011", "码号信息错误，请检查MSISDN、ICCID、IMSI是否正确", "码号信息错误，请检查MSISDN、ICCID、IMSI是否正确"),
    ERR11012("11012", "POST请求仅支持JSON格式", "POST请求的参数格式非JSON格式"),
    ERR11013("11013", "该商品存在商品属性,请填写商品属性", "该商品存在商品属性,请填写商品属性"),
    ERR11014("11014", "商品属性填写不合法", "商品属性填写不合法"),
    ERR11015("11015", "商品属性请求参数节点缺失或节点名称错误", "商品属性请求参数节点缺失或节点名称错误"),
    ERR11016("11016", "商品属性code填写错误", "商品属性code填写错误"),
    ERR11017("11017", "资费id为空", "资费id为空"),
    ERR11018("11018", "APN信息为空", "APN信息为空"),
    ERR11019("11019", "号码不正确，请核查", "号码不正确，请核查"),
    ERR11020("11020", "短信接入码不正确，请核查", "短信接入码不正确，请核查"),
    ERR11021("11021", "群组主资费为融合流量池类型,请正确填写通用定向流量标识", "群组主资费为融合流量池类型,请正确填写通用定向流量标识"),
    ERR11022("11022", "群组主资费为融合流量共享类型,请正确填写通用定向流量标识", "群组主资费为融合流量共享类型,请正确填写通用定向流量标识"),
    ERR11023("11023","fenceID不存在","fenceID不存在"),
    ERR11024("11024","输入fenceID不存在或不归属EC账户，请查证后输入","输入fenceID不存在或不归属EC账户，请查证后输入(电子围栏)"),
    ERR11025("11025","圆形半径长度不符和规范，创建或更新围栏失败","圆形半径长度不符和规范，创建或更新围栏失败"),
    ERR11026("11026","fenceName不符合规则，创建或更新围栏失败","fenceName不符合规则，创建或更新围栏失败"),
    ERR11027("11027","围栏监控卡数量已达上限","围栏监控卡数量已达上限"),
    ERR11028("11028","传入行政区域区号不存在，创建或更新围栏失败","传入行政区域区号不存在，创建或更新围栏失败"),
    ERR11029("11029","多边形传入点数量不符合规范，创建或更新围栏失败","多边形传入点数量不符合规范，创建或更新围栏失败"),
    ERR11030("11030","传入经纬度数据不符合规范，创建或更新围栏失败","传入经纬度数据不符合规范，创建或更新围栏失败"),
    ERR11031("11031","添加物联卡已存在，添加失败","添加物联卡已存在，添加失败"),
    ERR11032("11032","删除物联卡不存在，删除失败","删除物联卡不存在，删除失败"),
    ERR11033("11033","更新围栏类型与现有类型不一致，更新围栏失败","更新围栏类型与现有类型不一致，更新围栏失败"),
    ERR11034("11034","fenceName重复,创建或更新围栏失败","fenceName重复,创建或更新围栏失败"),
    ERR11035("11035", "阈值规则必须是Level1<Level2<Level3", "阈值规则必须是Level1<Level2<Level3"),
    ERR11036("11036", "该apnType为0时，apnName必须是通用的APN", "该apnType为0时，apnName必须是通用的APN"),
    ERR11037("11037", "充值金额范围不在1.00圆-500.00圆", "充值金额范围不在1.00圆-500.00圆"),
    ERR11038("11038", "成员APN必须大于等于群组APN", "成员APN必须大于等于群组APN"),
    ERR11039("11039", "商品订购失败，请检查商品信息是否正常", "商品订购失败，请检查商品信息是否正常"),
    ERR11041("11041", "白名单格式不正确，不允许操作", "白名单格式不正确，不允许操作"),
    ERR11042("11042", "群组Id格式错误", "群组Id格式错误"),

    //鉴权类
    ERR12000("12000", "订购关系鉴权不通过", "订购关系鉴权不通过"),
    ERR12001("12001", "应用信息错误，请检查应用状态", "应用信息错误，请检查应用状态"),
    ERR12002("12002", "集团状态不正常，请检查集团状态", "集团状态不正常，请检查集团状态"),
    ERR12003("12003", "IP地址鉴权不通过", "IP地址鉴权不通过"),
    ERR12004("12004", "TOKEN鉴权不通过", "TOKEN鉴权不通过"),
    ERR12005("12005", "白名单鉴权不通过，请联系管理员添加白名单", "白名单鉴权不通过，请联系管理员添加白名单"),
    ERR12006("12006", "号码没有归属省份", "号码没有归属省份"),
    ERR12007("12007", "MSISDN号不是所查询的集团下的用户", "MSISDN号不是所查询的集团下的用户"),
    ERR12008("12008", "IMSI号不是所查询的集团下的用户", "IMSI号不是所查询的集团下的用户"),
    ERR12009("12009", "ICCID号不是所查询的集团下的用户", "ICCID号不是所查询的集团下的用户"),
    ERR12010("12010", "MSISDN号不是所查询的省公司下的用户", "MSISDN号不是所查询的省公司下的用户"),
    ERR12011("12011", "IMSI号不是所查询的省公司下的用户", "IMSI号不是所查询的省公司下的用户"),
    ERR12012("12012", "ICCID号不是所查询的省公司下的用户", "ICCID号不是所查询的省公司下的用户"),
    ERR12013("12013", "MSISDN号不是所查询的客户下的用户", "MSISDN号不是所查询的内部部门或集团子公司下的用户"),
    ERR12014("12014", "IMSI号不是所查询的客户下的用户", "IMSI号不是所查询的内部部门或集团子公司下的用户"),
    ERR12015("12015", "ICCID号不是所查询的客户下的用户", "ICCID号不是所查询的内部部门或集团子公司下的用户"),
    ERR12016("12016", "省公司ID不正确", "省公司ID不正确"),
    ERR12017("12017", "ecid不是所查询的省下的集团客户", "ecid不是所查询的省下的集团客户"),
    ERR12018("12018", "CUSTID不是所查询的省公司下的用户", "CUSTID不是所查询的省公司下的用户"),
    ERR12019("12019", "该卡号所属区域暂不支持该功能", "省BOSS或者其他网元不支持该API业务"),
    ERR12020("12020", "群组ID不属于所查询的EC客户", "群组ID不属于所查询的EC客户"),
    ERR12021("12021", "TOKEN不存在或已过期，请重新获取", "TOKEN超出规定使用时限或错误"),
    ERR12022("12022", "PASSWORD鉴权不通过", "PASSWORD鉴权不通过"),
    ERR12023("12023", "secretKey鉴权不通过", "secretKey鉴权不通过"),
    ERR12024("12024", "imei鉴权不通过", "imei鉴权不通过"),
    ERR12025("12025", "客户实例不存在", "客户实例不存在"),
    ERR12026("12026", "当前卡状态不支持该操作,操作类型的初始状态与卡当前状态不一致", "sim卡的状态不允许变更为操作的状态"),
    ERR12027("12027", "用户尚有未完成订单,不允许办理业务", "用户尚有未完成订单,不允许办理业务"),
    ERR12028("12028", "用户状态不是已激活状态", "用户状态不是已激活状态"),
    ERR12029("12029", "订购资费与已订购资费存在互斥关系,不允许订购", "订购资费与已订购资费存在互斥关系,不允许订购"),
    ERR12030("12030", "用户已订购资费,不能重复订购", "用户已订购资费,不能重复订购"),
    ERR12031("12031", "产商品互斥，订购或退订失败", "产商品互斥，订购或退订失败"),
    ERR12032("12032", "订购资费与已订购资费存在依赖关系,不允许退订", "订购资费与已订购资费存在依赖关系,不允许退订"),
    ERR12033("12033", "用户没有订购资费不能退订或修改属性", "用户没有订购资费不能退订或修改属性"),
    ERR12034("12034", "群组ID不属于本企业", "群组ID不属于本企业"),
    ERR12035("12035", "卡号不属于本企业", "卡号不属于本企业"),
    ERR12036("12036", "群组用户状态不正常,不能成员管理", "群组用户状态不正常,不能成员管理"),
    ERR12037("12037", "成员用户状态是已停机或预销户或已销户状态，不能成员管理", "成员用户状态是已停机或预销户或已销户状态，不能成员管理"),
    ERR12038("12038", "群组主资费为智能网语音类型，暂不支持成员管理", "群组主资费为智能网语音类型，暂不支持成员管理"),
    ERR12039("12039", "成员已在当前群组用户下,不能重复添加", "成员已在当前群组用户下,不能重复添加"),
    ERR12040("12040", "成员已在其他流量群组用户下,不能添加", "成员已在其他流量群组用户下,不能添加"),
    ERR12041("12041", "成员未在当前群组下,不能删除", "成员未在当前群组下,不能删除"),
    ERR12042("12042", "成员开通的APN必须包含群组关联的APN，才可添加成功", "成员开通的APN必须包含群组关联的APN，才可添加成功"),
    ERR12043("12043", "群组用户有在途订单,不能成员管理", "群组用户有在途订单,不能成员管理"),
    ERR12044("12044", "用户尚有未完成订单，不允许办理该NG-API业务", "用户尚有未完成订单，不允许办理该业务"),
    ERR12045("12045", "用户状态不是可测试、已激活，不能办理通信服务开停", "用户状态不是可测试、已激活，不能办理通信服务开停"),
    ERR12046("12046", "用户没有订购该服务，不能暂停和恢复", "用户没有订购该服务，不能暂停和恢复"),
    ERR12047("12047", "用户该服务已经是暂停状态，不能重复暂停", "用户该服务已经是暂停状态，不能重复暂停"),
    ERR12048("12048", "用户该服务不是暂停状态，不能恢复", "用户该服务不是暂停状态，不能恢复"),
    ERR12049("12049", "该卡号不属于此群组", "该卡号不属于此群组"),
    ERR12050("12050", "群组用户状态不正常,不能设置限额", "群组用户状态不正常,不能设置限额"),
    ERR12051("12051", "该apnName未配置限额，不能进行删除限额设置或修改限额设置", "该apnName未配置限额，不能进行删除限额设置或修改限额设置"),
    ERR12052("12052", "群组用户未订购该商品", "群组用户未订购该商品"),
    ERR12053("12053", "群组用户订购商品不能设置限额", "群组用户订购商品不能设置限额"),
    ERR12054("12054", "码号不是所查询的群组下的用户", "码号不是所查询的群组下的用户"),
    ERR12055("12055", "当前不支持限额规则的修改", "当前不支持限额规则的修改"),
    ERR12056("12056", "用户没有订购自发起降速商品，不能自发起降速","用户没有订购自发起降速商品，不能自发起降速"),
    ERR12057("12057", "用户不是已激活状态，不能自发起降速","用户不是已激活状态，不能自发起降速"),
    ERR12058("12058", "用户的基础服务状态为关停等，不能自发起降速", "用户的基础服务状态为关停等，不能自发起降速"),
    ERR12059("12059", "不能同步非授权集团下的卡信息", "不能同步非授权集团下的卡信息"),
    ERR12060("12060", "用户没有订购该APN，不能暂停和恢复", "用户没有订购该APN，不能暂停和恢复"),
    ERR12061("12061", "当前停机原因不符合自主发起复机操作要求,只有主动申请停机的才允许自主复机", "当前停机原因不符合自主发起复机操作要求,只有主动申请停机的才允许自主复机"),
    ERR12062("12062", "物联卡不对应当前操作的管理平台", "物联卡不对应当前操作的管理平台"),
    ERR12063("12063", "APN不正确，不能自发起降速", "输入正确的APN"),
    ERR12065("12065", "资费包可调用次数已使用完毕或已过期", "请重新订购资费包"),
    ERR12066("12066", "批量查询的卡号必须归属为同一(或指定)EC", "内部/省公司接口批量查询的卡号必须归属为同一（或指定）EC"),
    ERR12067("12067", "ecid不对应当前操作的管理平台", "ecid不对应当前操作的管理平台"),
    ERR12068("12068", "该卡实名登记请求次数已超过系统每日最大限制（10次）", "该卡实名登记请求次数已超过系统每日最大限制（10次）"),
    ERR12069("12069", "该卡已被其他人实名登记", "该卡已被其他人实名登记"),
    ERR12070("12070", "该卡你已实名登记，无需重复实名登记", "该卡你已实名登记，无需重复实名登记"),
    ERR12071("12071", "人证比对不一致", "人证比对不一致"),
    ERR12072("12072", "ICCID和MSISDN对应关系错误", "ICCID和MSISDN对应关系错误"),
    ERR12073("12073", "群组已有成员数加上添加成员数超出最大数量", "群组已有成员数加上添加成员数超出最大数量"),
    ERR12074("12074", "成员用户状态是已销户状态，不能设置限额", "成员用户状态是已销户状态，不能设置限额"),
    ERR12075("12075", "群组主资费为智能网语音类型，暂不支持设置限额", "群组主资费为智能网语音类型，暂不支持设置限额"),
    ERR12076("12076", "apnName不正确，不能对该apn设置限额", "apnName不正确，不能对该apn设置限额"),
    ERR12077("12077", "该apnName已配置限额，不能进行重复设置限额", "该apnName已配置限额，不能进行重复设置限额"),
    ERR12078("12078", "手机号码格式错误", "手机号码格式错误"),
    ERR12079("12079", "手机号码位数错误", "手机号码位数错误"),
    ERR12080("12080", "身份证号码位数错误", "身份证号码位数错误"),
    ERR12081("12081", "该卡正在认证，请稍候再试", "该卡正在认证，请稍候再试"),
    ERR12082("12082", "该卡的主商品和欲订购的加油包主商品不一致", "该卡的主商品和欲订购的加油包主商品不一致"),
    ERR12083("12083", "加油包仅支持“已激活”的卡订购，当前卡状态不支持该操作", "加油包仅支持“已激活”的卡订购，当前卡状态不支持该操作"),
    ERR12084("12084", "该加油包商品和加油包主商品不对应，请核实", "该加油包商品和加油包主商品不对应，请核实"),
    ERR12085("12085", "该卡的主商品不是物联卡和车联网，请核实", "该卡的主商品不是物联卡和车联网，请核实"),
    ERR12086("12086", "该卡已销户，无法实名", "该卡已销户，无法实名"),
    ERR12087("12087", "充值缴费验证失败", "充值缴费验证失败"),
    ERR12088("12088", "不允许对集团统付的卡进行充值", "不允许对集团统付的卡进行充值"),
    ERR12089("12089", "该卡状态不是\"已激活\"，\"待激活\"，\"可测试\"，\"库存\"，不支持该操作", "该卡状态不是\"已激活\"，\"待激活\"，\"可测试\"，\"库存\"，不支持该操作"),
    ERR12090("12090", "该卡已在话单侧进行机卡绑定，请勿重复绑定", "该卡已在话单侧进行机卡绑定，请勿重复绑定"),
    ERR12091("12091", "该卡已在网络侧进行机卡绑定，不支持同时在话单侧进行机卡绑定", "该卡已在网络侧进行机卡绑定，不支持同时在话单侧进行机卡绑定"),
    ERR12092("12092", "该卡未在话单侧进行机卡绑定，请核实后提交", "该卡未在话单侧进行机卡绑定，请核实后提交"),
    ERR12093("12093", "该卡已在网络侧进行机卡绑定，请勿重复绑定", "该卡已在网络侧进行机卡绑定，请勿重复绑定"),
    ERR12094("12094", "该卡已在话单侧进行机卡绑定，不支持同时在网络侧进行机卡绑定", "该卡已在话单侧进行机卡绑定，不支持同时在网络侧进行机卡绑定"),
    ERR12095("12095", "该卡的部分APN不支持PCC策略，故无法在网络侧进行机卡绑定", "该卡的部分APN不支持PCC策略，故无法在网络侧进行机卡绑定"),
    ERR12096("12096", "该卡未在网络侧进行机卡绑定，请核实后提交", "该卡未在网络侧进行机卡绑定，请核实后提交"),
    ERR12097("12097", "当前卡状态不支持该操作", "当前卡状态不支持该操作"),
    ERR12098("12098", "当前停机原因不符合自主发起复机操作要求,只有主动申请停机的才允许自主复机", "当前停机原因不符合自主发起复机操作要求,只有主动申请停机的才允许自主复机"),
    ERR12099("12099", "预销户或已销户的群组不支持该操作", "预销户或已销户的群组不支持该操作"),
    ERR12100("12100", "非智能网语音群组不支持该操作", "非智能网语音群组不支持该操作"),
    ERR12101("12101", "该群组的语音白名单总数已达到最大限制", "该群组的语音白名单总数已达到最大限制"),
    ERR12102("12102", "新增的语音白名单号码与该群组现有的语音白名单号码重复", "新增的语音白名单号码与该群组现有的语音白名单号码重复"),
    ERR12103("12103", "该群组现有的语音白名单号码（生效）不包含需删除的号码，请确认后再提交", "该群组现有的语音白名单号码（生效）不包含需删除的号码，请确认后再提交"),
    ERR12104("12104", "该群组现有的语音白名单号码（已失效）不包含需重新添加的号码，请确认后再提交", "该群组现有的语音白名单号码（已失效）不包含需重新添加的号码，请确认后再提交"),
    ERR12105("12105", "预销户或已销户的成员不支持该操作", "预销户或已销户的成员不支持该操作"),
    ERR12106("12106", "该成员没有加入该群组", "该成员没有加入该群组"),
    ERR12107("12107", "该成员的语音白名单总数已达到最大限制", "该成员的语音白名单总数已达到最大限制"),
    ERR12108("12108", "新增的语音白名单号码与该成员现有的语音白名单号码重复", "新增的语音白名单号码与该成员现有的语音白名单号码重复"),
    ERR12109("12109", "该成员现有的语音白名单号码（生效）不包含需删除的号码，请确认后再提交", "该成员现有的语音白名单号码（生效）不包含需删除的号码，请确认后再提交"),
    ERR12110("12110", "该成员现有的语音白名单号码（已失效）不包含需重新添加的号码，请确认后再提交", "该成员现有的语音白名单号码（已失效）不包含需重新添加的号码，请确认后再提交"),
    ERR12111("12111", "APNNAME必须为NB公有APN", "APNNAME必须为NB公有APN"),
    ERR12112("12112", "精度类型错误或者精度值不符合精度类型对应的精度列表中的数据", "精度类型错误或者精度值不符合精度类型对应的精度列表中的数据"),
    ERR12113("12113", "白名单功能状态为“去激活”的成员不支持该操作", "白名单功能状态为“去激活”的成员不支持该操作"),
    ERR12114("12114", "当前卡已与其他IMEI模组绑定", "当前卡已与其他IMEI模组绑定"),
    ERR12115("12115", "当前IMEI模组已与其他卡绑定", "当前IMEI模组已与其他卡绑定"),
    ERR12116("12116", "IMEI模组与卡绑定失败", "IMEI模组与卡绑定失败"),
    ERR12117("12117", "当前卡未与任何IMEI模组绑定", "当前卡未与任何IMEI模组绑定"),
    ERR12118("12118", "IMEI模组与卡解绑失败", "IMEI模组与卡解绑失败"),
    ERR12119("12119", "IMEI模组和MSISDN对应关系错误", "IMEI模组和MSISDN对应关系错误"),
    ERR12120("12120", "停复机原因错误,请核实", "停复机原因错误,请核实"),
    ERR12121("12121", "该白名单在群组失效白名单列表，请选择重新添加的方式添加", "该白名单在群组失效白名单列表，请选择重新添加的方式添加"),
    ERR12122("12122", "该白名单在成员失效白名单列表，请选择重新添加的方式添加", "该白名单在成员失效白名单列表，请选择重新添加的方式添加"),
    ERR12123("12123", "该卡处于管理停机状态，无法自助办理业务，详询客户经理", "该卡处于管理停机状态，无法自助办理业务，详询客户经理"),
    ERR12124("12124", "该apnType为1时，APNname必须是专用的APN", "该apnType为1时，APNname必须是专用的APN"),
    ERR12125("12125", "集团编码与集团名称不一致，请核查", "集团编码与集团名称不一致，请核查"),
    ERR12126("12126", "生日与身份证号码不匹配", "生日与身份证号码不匹配"),
    ERR12127("12127","当前接口仅支持OneLink-CT平台的卡号","当前接口仅支持OneLink-CT平台的卡号"),
    ERR12128("12128","该卡已被冻结，无法自助办理业务，详询客户经理","该卡已被冻结，无法自助办理业务，详询客户经理"),
    ERR12129("12129","该套餐仅支持“已激活”的卡订购，当前卡状态不支持该操作","该套餐仅支持“已激活”的卡订购，当前卡状态不支持该操作"),
    ERR12130("12130","该卡没有开通该APN，不能订购该商品","该卡没有开通该APN，不能订购该商品"),
    ERR12131("12131","该卡没有开通国际漫游业务，不能订购该商品","该卡没有开通国际漫游业务，不能订购该商品"),
    ERR12132("12132","该卡没有订购该商品，不能退订该商品","该卡没有订购该商品，不能退订该商品"),
    ERR12133("12133","导入的SIM主商品与其选择的主商品类别不同","导入的SIM主商品与其选择的主商品类别不同"),
    ERR12134("12134","该卡未订购流量用尽关停套餐的，不能订购流量用尽关停解除套餐","该卡未订购流量用尽关停套餐的，不能订购流量用尽关停解除套餐"),
    ERR12135("12135","apnName所属类型与所订购资费不匹配","apnName所属类型与所订购资费不匹配"),
    ERR12136("12136","群组主资费为智能网语音类型,暂不支持查询","群组主资费为智能网语音类型,暂不支持查询"),
    ERR12137("12137","该apnName已下架，无法开通或订购，请核实后处理","该apnName已下架，无法开通或订购，请核实后处理"),
    ERR12140("12140","取消失败，监控来源与监控规则设置不一致","取消失败，监控来源与监控规则设置不一致"),
    ERR12141("12141","当前停机原因不符合自主发起复机操作要求,只有主动申请停机一个原因的才允许自主复机","当前停机原因不符合自主发起复机操作要求,只有主动申请停机一个原因的才允许自主复机"),


    //流控类
    ERR13000("13000", "系统忙，请稍后再试", "已超出系统调用限制，请稍后再试"),
    ERR13001("13001", "已超出单位时间内客户对该能力的调用量限制，请稍后再试", "已超出订购级单位时间客户调用限制，请稍后再试"),
    ERR13002("13002", "已超出HLR Agent调用限制，请稍后再试", "已超出HLR Agent调用限制，请稍后再试"),
    ERR13003("13003", "已超出单位时间内客户总调用量的限制，请稍后再试", "已超出EC级单位时间客户调用限制，请稍后再试"),
    ERR13004("13004", "系统忙，请稍后再试", "ccmp3.0接口请求超过指定流量"),
    ERR13005("13005", "系统忙，请稍后再试", "ccmp3.0服务端响应超过指定流量"),
    ERR13006("13006", "系统忙，请稍后再试", "ccmp3.0调用频率过多"),
    ERR13007("13007", "系统忙，请稍后再试", "ccmp3.0并发超过阀值"),
    ERR13009("13009", "同一卡号30分钟内不能通过此类接口重复办理业务", "同一卡号30分钟内不能通过此类接口重复办理业务"),
    //数据类
    ERR14000("14000", "系统无记录，请检查输入参数是否正确", "数据库无记录"),
    ERR14001("14001", "暂时查询不到数据，请早上9点后再试", "数据文件还未生成"),
    ERR14002("14002", "集团未订购流量池", "集团未订购流量池"),
    ERR14003("14003", "数据正在生成中", "数据还未生成"),
    ERR14004("14004", "文件不存在", "文件型接口的文件未生成，或已被删除"),
    ERR14005("14005", "操作群组对象不存在", "操作群组对象不存在"),
    ERR14006("14006", "操作用户对象不存在", "操作用户对象不存在"),
    ERR14007("14007", "操作资费对象不存在", "操作资费对象不存在"),
    ERR14008("14008", "查询不到信息", "查询不到信息"),
    ERR14009("14009", "资费详情查询不到信息", "资费详情查询不到信息"),
    ERR14010("14010", "降速档位不存在", "降速档位不存在"),
    ERR14011("14011", "获取区号信息失败", "大数据侧GGSN报文缺失区号信息"),
    ERR14012("14012", "基站数据不存在；请检查基站编号是否正确", "基站数据不存在；请检查基站编号是否正确"),
    ERR14013("14013", "多基站计算失败/计算结果不准确", "多基站计算失败/计算结果不准确"),
    //系统类
    ERR19000("19000", "其它错误，请联系管理员", "数据库访问异常"),
    ERR19001("19001", "系统忙，请稍后再试", "(运管)微服务熔断，服务不可用"),
    ERR19002("19002", "其它错误，请联系管理员", "CCMP3.0平台异常"),
    ERR19003("19003", "其它错误，请联系管理员", "CCMP3.0服务调用失败"),
    ERR19004("19004", "其它错误，请联系管理员", "CCMP3.0调用服务不存在"),
    ERR19005("19005", "其它错误，请联系管理员", "CCMP3.0调用服务版本不存在"),
    ERR19006("19006", "其它错误，请联系管理员", "CCMP3.0调用服务已关闭"),
    ERR19007("19007", "其它错误，请联系管理员", "CCMP3.0平台其他异常"),
    ERR19008("19008", "其它错误，请联系管理员", "CCMP3.0服务端异常"),
    ERR19009("19009", "其它错误，请联系管理员", "CCMP3.0服务端连接异常"),
    ERR19010("19010", "其它错误，请联系管理员", "CCMP3.0服务端返回超时"),
    ERR19011("19011", "其它错误，请联系管理员", "CCMP3.0服务端请求超时"),
    ERR19012("19012", "其它错误，请联系管理员", "CCMP3.0服务端内部异常"),
    ERR19013("19013", "其它错误，请联系管理员", "CCMP3.0服务端内部异常"),
    ERR19014("19014", "其它错误，请联系管理员", "CCMP3.0服务容错"),
    ERR19015("19015", "其它错误，请联系管理员", "CCMP3.0其他异常"),
    ERR19016("19016", "其它错误，请联系管理员", "CCMP3.0系统错误"),
    ERR19017("19017", "系统忙，请稍后再试", "CCMP3.0系统忙，请稍后再试"),
    ERR19018("19018", "其它错误，请联系管理员", "CCCMP3.0调用后端接口异常"),
    ERR19019("19019", "其它错误，请联系管理员", "CCMP3.0其他错误"),
    ERR19999("19999", "其它错误，请联系管理员", "调用系统错误，请联系管理员"),
    //HLR通信类
    ERR30000("30000", "通信失败，请稍后再试", "HLR通信无响应"),
    ERR30001("30001", "通信失败，请稍后再试", "HLR通信失败，result code=99"),
    ERR30002("30002", "通信失败，请稍后再试", "HLR agent通信获取系统参数失败"),
    ERR30003("30003", "用户关机或无法接通", "用户关机或无法接通"),
    ERR30004("30004", "短信重置失败，请联系管理员", "短信重置失败，请联系管理员"),
    ERR30005("30005", "通信失败，请稍后再试", "CCMP3.0侧HLR通信异常"),
    ERR30006("30006", "通信失败，请稍后再试", "CCMP3.0侧HLR通信类其他异常"),
    ERR30007("30007", "GPRS上网功能重置失败", "GPRS上网功能重置失败"),
    //PBOSS/CTBOSS通信类
    ERR31000("31000", "通信失败，请稍后再试", "号码余额查询通信失败，请稍后再试"),
    ERR31001("31001", "通信失败，请稍后再试", "PBOSS agent通信失败，请联系管理员"),
    ERR31002("31002", "通信失败，请稍后再试", "PBOSS参数校验错误，请联系管理员"),
    ERR31003("31003", "该号码已经提交了业务办理申请，在前一业务办理未完成前不能提交新的业务办理申请 ", "同一号码不能同时办理多个业务"),
    ERR31004("31004", "其它错误，请联系管理员", "PBOSS处理异常"),
    ERR31005("31005", "通信失败，请稍后再试", "CTBOSS通信异常"),
    ERR31006("31006", "通信失败，请稍后再试", "CTBOSS通信其他异常"),
    ERR31007("31007", "该用户未订购达量限速产品", "该用户未订购达量限速产品"),
    //网关通信类
    ERR32000("32000", "通信失败，请稍后再试", "网关通信错误"),
    ERR32001("32001", "管理短信白名单失败", "管理短信白名单失败"),
    ERR32002("32002", "只有中国移动的号码才能够加入白名单", "只有中国移动的号码才能够加入白名单"),
    ERR32003("32003", "添加白名单个数超过最大个数限制", "添加白名单个数超过最大个数限制"),
    ERR32004("32004", "删除白名单个数超过最大个数限制", "删除白名单个数超过最大个数限制"),
    ERR32005("32005", "不能删除未加入白名单的卡号", "不能删除未加入白名单的卡号"),
    ERR32006("32006", "接入码不存在", "接入码不存在"),
    ERR32007("32007", "不能新增已加入白名单的卡号", "不能新增已加入白名单的卡号"),
    ERR32008("32008", "卡号不属于该EC", "卡号不属于该客户，不能操作白名单"),
    ERR32009("32009", "通信失败，请稍后再试", "CCMP3.0侧网关通信类异常"),
    ERR32010("32010", "通信失败，请稍后再试", "CCMP3.0侧网关通信类其他异常"),
    //LBS通信类
    ERR33000("33000", "定位失败，请稍后再试", "定位失败，请联系管理员");

    /**
     * 错误码
     */
    private String code;
    /**
     * 错误描述
     */
    private String msg;

    /**
     * 描述
     * V5详细解释
     * 主要用于内部错误信息描述
     */
    private String description;

    CCErrorCode(String code, String msg, String description) {
        this.code = code;
        this.msg = msg;
        this.description = description;
    }

    public String getCode() {
        return code;
    }

    public String getMsg() {
        return msg;
    }

    public String getDescription() {
        return description;
    }

    public void setCode(String code) { this.code = code; }

    public void setMsg(String msg) { this.msg = msg; }

    public void setDescription(String description) { this.description = description; }
}
